<a href="https://colab.research.google.com/github/AnimeshKumar923/college-stuff/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Experiment 1(b): Explore data pre-processing packages and AIML algorithms.

## Software Used: Google colaboratory

##  Data Manipulation using Pandas (Working with CSV)

- Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures.
- Self Learning Resource
    - Pandas in 10 Minutes: <a href="https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html"> Click Here </a>
    - Video1: https://www.youtube.com/watch?v=QUClKFFn1Vk
    - Video2: https://www.youtube.com/watch?v=tW1BWtQRZ2M
    - Video3: https://www.youtube.com/watch?v=xx4Vkc5RrWY
    


##### Note: 
1. To execute the code --> Click on a cell and press cntrl + enter key

## <span style='color:Red'> 1. Working with data file (csv)</span>

### 1.1 Read csv file

In [ ]:
##pip install pandas
import pandas as pd

df = pd.read_csv('/content/data14.csv') # open the file
print(type(df))

df.head()

In [ ]:
# Get the datatype of each column
df.dtypes

id      int64
F1      int64
F2    float64
F3    float64
F4    float64
F5      int64
F6    float64
F7    float64
dtype: object

In [ ]:
# To read files

# To Read CSV  file  --> pd.read_csv()
# To Read Excel file --> pd.read_excel()
# To Read Json  file --> pd.read_json() ## JavaScript Object Notation (JSON) is a standard text-based format for representing structured data based on JavaScript object syntax.
# To Read HTML  file --> pd.read_html()

# Self learning: How to read data from SQL, MongoDB, Oracle, MySQL using python

### 1.2 Get the dimention of the dataset

In [ ]:
df.head()
print("df.shape -->", df.shape) # rows and columns
print("Rows     -->", df.shape[0])  ##axis 0---row
print("Columns  -->", df.shape[1])   ###column

df.shape --> (12067, 8)
Rows     --> 12067
Columns  --> 8

### 1.3 Show top 5 rows of the dataset

In [ ]:
df.head()

# Try Also
#df.head(10)  # top 10 lines
#df.head(20)

### 1.4 Show bottom 5 rows of the dataset

In [ ]:
df.tail()

# Try Also
#df.tail(10)
#df.tail(20)

In [ ]:
# Question: Select rowz from 51 to 60
# Answer: df.head(61).tail(10)

### 1.5 Get all column names of the dataset

In [ ]:
df.columns

# Try Also
#len(df.columns)

Index(['id', 'F1', 'F2', 'F3', 'F4', 'F5', 'F6', 'F7'], dtype='object')

### 1.6 Get the index

In [ ]:
df.index

RangeIndex(start=0, stop=12067, step=1)

### 1.7 Get the statistical summary of the dataset

In [ ]:
df.describe()   # column wise data is provided

                 id            F1  ...            F6            F7
count  1.206700e+04  12067.000000  ...  12059.000000  12055.000000
mean   4.502005e+09      0.499378  ...  16507.752384      6.915869
std    2.691983e+07      0.500020  ...   1534.554755      0.303914
min    4.295358e+09      0.000000  ...  10730.000000      4.600000
25%    4.488640e+09      0.000000  ...  15420.500000      6.800000
50%    4.512745e+09      0.000000  ...  16400.000000      7.000000
75%    4.522339e+09      1.000000  ...  17464.500000      7.200000
max    4.527991e+09      1.000000  ...  23701.000000      8.000000

[8 rows x 8 columns]

### 1.8 Get the information related to the dataset

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12067 entries, 0 to 12066
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      12067 non-null  int64
 1   F1      12067 non-null  int64
 2   F2      11985 non-null  float64
 3   F3      12057 non-null  float64
 4   F4      12006 non-null  float64
 5   F5      12067 non-null  int64
 6   F6      12059 non-null  float64
 7   F7      12055 non-null  float64
dtypes: float64(5), int64(3)
memory usage: 754.3 KB

### 1.9 Transposing the dataset

In [ ]:
df.T   # shuffle rows and columns

### 1.10 Accessing data from dataset - Part 1 (using loc - Column Names)

In [ ]:
# Syntax --> loc[ ROW, COL_Names_in_List ]    # selective accessing

#df.loc[:, ['F1','F3','F6']]

# Also Try
df.loc[:10 , ['F1','F3','F6']]
#df.loc[10:100 , ['F1','F3','F6','F7']]

### 1.11 Accessing data from dataset - Part 2 (using iloc - Column position)

In [ ]:
# Syntax --> iloc[ ROW, COL_Position]

#df.iloc[0:10, 5:]

# Also Try
#df.iloc[10:100, :-2]
df.iloc[20:30, 1:5]

The unique() function is used to get unique values of Series object.

Uniques are returned in order of appearance. Hash table-based unique, therefore does NOT sort.

### 1.12 To get unique values in a Column (factors)

In [ ]:
df['F1'].unique()      # not having repetition 

len(df['F1'].unique())

#df['F4'].unique()

#len(df['F4'].unique())   # total unique values in the data set

KeyError: ignored

### 1.13 To get unique count  in a Column

In [ ]:
#df['F1'].value_counts()   # times the unique value has occurred
df['F4'].value_counts()

### 1.14 Selecting data using condition - part 1

In [ ]:
df[df['F4']>10]     # rows value greater than 10 will appear

df[df['F4']>10].shape

#df[(df['F4']>20) & (df['F1'] == 1)]

#df[(df['F4']>20) | (df['F1'] == 1)].shape

### 1.19 Get the correlation of the all the columns present in the dataset

In [ ]:
df.corr()      # correlation between the columns 

# Note
# 1. Shows the relationship between two objects (or data columns)
# 2. Correlation value lies between -1 and +1
# 3. If correlation of two columns (Features) is greater than 0.8 (or 0.85 or 0.9), 
#    then we can drop one of the column.

### 1.26 IsNull: This returns true or false depending on the status of the cell

In [ ]:
df.isnull()

# Shows True where NULL are present in the dataset else show False

### 1.27 Aggregate of all the values which are null

In [ ]:
df.isnull().sum()    # total null values in particular column

### 1.28 Drop NA values (delete rows)

In [ ]:
# Creating new sample dataset  (Dataframe)

import pandas as pd


df = pd.DataFrame({"Name":["Iron-Man","Wonder-Woman","Avengers","Ramayan"],  # name ,house and start are columns
                     "House":["Marvel","DC Comics","Marvel","Ramanand Sagar"],
                     "Start":[pd.NaT, pd.Timestamp("2017-05-15"), 
                              pd.NaT, pd.Timestamp("1987-01-25")]})

df

In [ ]:
df.isnull()

    Name  House  Start
0  False  False   True
1  False  False  False
2  False  False   True
3  False  False  False

In [ ]:
df.isnull().sum()

Name     0
House    0
Start    2
dtype: int64

In [ ]:
df

           Name           House      Start
0      Iron-Man          Marvel        NaT
1  Wonder-Woman       DC Comics 2017-05-15
2      Avengers          Marvel        NaT
3       Ramayan  Ramanand Sagar 1987-01-25

In [ ]:
df.dropna()     # Drop those rows having any "NA"
                    # But, No change in the original Data

           Name           House      Start
1  Wonder-Woman       DC Comics 2017-05-15
3       Ramayan  Ramanand Sagar 1987-01-25

### 1.29 Drop the columns where there are null values

In [ ]:
df

In [ ]:
df.dropna(axis = 'columns')   # by default deletes the rows

### 1.31 Drop the null values where they are present

In [ ]:
df

In [ ]:
df.dropna(how = 'any') # Similar to df.dropna()

           Name           House      Start
1  Wonder-Woman       DC Comics 2017-05-15
3       Ramayan  Ramanand Sagar 1987-01-25

### 1.32 Fill the null values with '0'

In [ ]:
import pandas as pd


df = pd.DataFrame({"Name":["Iron-Man","Wonder-Woman","Avengers","Ramayan"],
                     "House":["Marvel","DC Comics","Marvel","Ramanand Sagar"],
                     "Start":[pd.NaT, pd.Timestamp("2017-05-15"), 
                              pd.NaT, pd.Timestamp("1987-01-25")]})

df

           Name           House      Start
0      Iron-Man          Marvel        NaT
1  Wonder-Woman       DC Comics 2017-05-15
2      Avengers          Marvel        NaT
3       Ramayan  Ramanand Sagar 1987-01-25

In [ ]:
df.fillna(0)    # filling instead of deleting
          # Fill ALL "NA" value to "0"

df

NameError: ignored

### 1.33 Replace Values

In [ ]:
import pandas as pd


df = pd.DataFrame({"Name":["Iron-Man","Wonder-Woman","Avengers","Ramayan"],
                     "House":["Marvel","DC Comics","Marvel","Ramanand Sagar"],
                     "Start":[pd.NaT, pd.Timestamp("2017-05-15"), 
                              pd.NaT, pd.Timestamp("1987-01-25")]})

           Name           House      Start
0      Iron-Man          Marvel        NaT
1  Wonder-Woman       DC Comics 2017-05-15
2      Avengers          Marvel        NaT
3       Ramayan  Ramanand Sagar 1987-01-25

In [ ]:
replaceValues = {'Start':10}  # Replace the values columnwise
df1=df.fillna(replaceValues)

In [ ]:
df1

           Name           House                Start
0      Iron-Man          Marvel                   10
1  Wonder-Woman       DC Comics  2017-05-15 00:00:00
2      Avengers          Marvel                   10
3       Ramayan  Ramanand Sagar  1987-01-25 00:00:00

### 1.40 Saving dataframe to csv file

In [ ]:
df1.to_csv("Test.csv")   # datafram converted to csv file again

# Open Test.csv

**Task:**
- Program 1: Read a csv file and apply Dropping columns function.
- Program 2: Read a csv file and select particular column while reading.
- Program 3: Reading a particular part from the dataframe.
- Program 4: Create a dataframe and draw a sample data to work.
- Program 5: Read a csv file and check the missing values in the dataframe.
- Program 6: Add missing values using loc and iloc.
- Program 7: Read a csv file and fill the missing values in the dataframe.
- Program 8: Read a csv file and drop the missing values in the dataframe.